/* Од стандарден влез се вчитува бројот N, бројот K и знакот C. Потоа се вчитуваат N текстуални низи (секоја во нов ред).
Да се испечатат на екран текстуалните низи кои го содржат знакот C точно K пати без разлика на големината на буквата.
Ако нема такви низи, да се испечати порака NONE. */

/*
**Напомена од програмерот:**
Оваа задача бара програмата да прочита и стрингови со празни места.
Програмава чита се' до празно место и потоа напишаното после празното место ќе се смета како друг стринг.
Пробав по начинот што е користен во решението дадено од courses (со fgets), но програмата не ми дозволува да напишам повеќе од еден стринг.
Обидете се да ја смените програмава за да работи како што треба, иначе оваа е најблиско до бараниот резултат колку што можам да постигнам.
*/

#include <stdio.h>
#include <string.h>
#include <ctype.h>

int charCount (char *a, char c)
{
    int j, charCounter = 0;
    for (j = 0; a[j] != '\0'; j++) {
        if (isalpha(a[j])) {
            if (tolower(a[j]) == tolower(c))
                charCounter++;
        }
    }
    return charCounter;
}

int main()
{
    int N, K, strCount = 0;
    char C, str[100];
    scanf("%d %d %c", &N, &K, &C);

    for (int i = 0; i < N; i++) {
        scanf("%100s", str);
        if (charCount(str, C) == K) {
            puts(str);
            strCount++;
        }
    }
    if (!strCount) printf("NONE");
    return 0;
}
