/* Да се напише програма која што за вчитан датум како влезна променлива (DD MM GGGG) ќе испечати на излез порака 1 или 0 во зависност од тоа дали внесениот датум е правилен или не.

Напомена: За проверка на валидноста на датумот разгледајте ги следниве потточки:
- за датумот 29.02. да се внимава дали станува збор за престапна година (престапна година е секоја година која што е делива со 400 или пак е делива со 4, но не и со 100)
- дали месецот е број помеѓу 1 и 12
- дали денот одговара со бројот на денови во тој месец */

#include <stdio.h>

int main()
{
   int d, m, y;
   scanf("%d %d %d", &d, &m, &y);

   if ((d <= 0) || (d >= 31)) {
        printf("0\n"); }
   else {
    if ((m <= 0) || (m >= 12)) {
        printf("0\n"); }
    else {
        if ( ((m == 2) || (m == 4) || (m == 6) || (m == 9) || (m == 11)) &&
            (d == 31) ) {
                printf("0\n");
            }
        else if ((m == 2) && (d == 30)) {
            printf("0\n");
        }
        else if ((m == 2) && (d == 29)) {
            if (y%400==0 || (y%4==0 && y%100!=0)) {
                printf("1\n"); }
            else {
                printf("0\n");
            }
        }
        else {
            printf("1\n");
        }
      }
    }
    return(0);
}
