/* Од стандарден влез се вчитува број N, а потоа и N цели броеви.
Да се испечати на екран најголемата разлика помеѓу два последователно внесени броја.
Да се реши без користење на низи!

Пример:
N=5, па се внесуваат 5 броја: 1,3,0,5,2. Разликите се соодветно:
3-1 = 2
0-3 = -3
5-0 = 5
2-5 = -3
Најголема разлика е 5. */

#include <stdio.h>
int main ()
{
    int n, first, x, i, diff = 0;
    scanf("%d", &n);
    scanf("%d", &first);
    for (i = n - 1; i > 0; --i) {
        scanf("%d", &x);
        if ((x - first) > diff || i == n - 1) {
            diff = x - first;
        }
    first = x;
    }
    printf("%d", diff);
    return 0;
}
