/* Полу-елка се црта со ѕвездички (*) и прачки (|) на следниот начин:

*
|
|**
|
|***
|
|****

Значи, во првиот ред има ѕвездичка. Во следниот ред има прачка.
Понатаму преку еден ред имаме или само прачка или прачка со неколку ѕвездички (една повеќе отколку во прет-претходниот ред).
Полу-елката завршува со ред во кој има една прачка и N ѕвездички.
За дадено N, отпечатете ја полу-елката според описот.

За N=4, треба на излез да се добие како примерот погоре. */

#include <stdio.h>

int main()
{
    int n, i, j;
    scanf("%d", &n);

    printf("*\n");
    for (i = n-1; i >= 1; i--) {
        printf("|\n|");
        for (j = i-1; j < n; j++) {
            printf("*");
            if (j == n-1) {
                printf("\n");
            }
        }
    }
    return 0;
}
