/* Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
- индекс (шестцифрен цел број)
- шест оценки од последниот семестар кој го слушал

Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот:
- просек на студентот
-- просекот да се испечати со точност од 3 децимали
- година на студии
-- студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.
- дали е награден (1 = награден, 0 = не е награден)
-- еден студент се наградува доколку има просек еднаков или поголем од 9.5 */

#include <stdio.h>
int main()
{
    //vnesuvaat se indeksot i ocenkite
    int i;
    float a, b, c, x, y, z;
    scanf("%d", &i);
    scanf("%f %f %f %f %f %f", &a, &b, &c, &x, &y, &z);
    if (((10<a) || (a<5)) ||
        ((10<b) || (b<5)) ||
        ((10<c) || (c<5)) ||
        ((10<x) || (x<5)) ||
        ((10<y) || (y<5)) ||
        ((10<z) || (z<5))) {
        printf("Vnesena e nevalidna ocenka!\n"); }
    else {

    //se presmetuva prosekot
    float d = (a + b + c + x + y + z) / 6;
    printf("Prosek: %.3f \n", d);

    //se odreduva godinata
    printf("Student: %d\n", i);
    int g = 23 - (i / 10000);
    printf("%d godina\n", g);

    //dobivanje nagrada
    printf("Nagraden: %d", (d >= 9.5));

    }
    return 0;
}
